/*----------------------------------------------------------------------------------------------------------------
 * Copyright(c)
 * ---------------------------------------------------------------------------------------------------------------
 * File Name : assembler.c
 * Author    : hlb
 * Brief     : 汇编指令
 * Date      : 2017.07.21
 * ---------------------------------------------------------------------------------------------------------------
 * Modifier                                    Data                                             Brief
 * -------------------------------------------------------------------------------------------------------------*/
#include "sys_manager.h"

/**
* @ Function Name : INTX_DISABLE
* @ Author        : hlb
* @ Brief         : 关闭全部中断
* @ Date          : 2017.07.21
* @ Modify        : ...
 **/
void INTX_DISABLE(void)
{		  
	__ASM volatile("cpsid i");
}

/**
* @ Function Name : INTX_ENABLE
* @ Author        : hlb
* @ Brief         : 打开中断
* @ Date          : 2017.07.21
* @ Modify        : ...
 **/
void INTX_ENABLE(void)
{
	__ASM volatile("cpsie i");		  
}

